
  #### Terraform Plan Validate All 📖: `success`
  Plan File: `tmp_plan/envs-shared.plan`

  <details><summary>Show Plan</summary>

  ```

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # google_bigquery_dataset.billing_dataset will be created
  + resource "google_bigquery_dataset" "billing_dataset" {
      + creation_time              = (known after apply)
      + dataset_id                 = "billing_data"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = false
      + effective_labels           = (known after apply)
      + etag                       = (known after apply)
      + friendly_name              = "GCP Billing Data"
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "US"
      + max_time_travel_hours      = (known after apply)
      + project                    = (known after apply)
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)
      + terraform_labels           = (known after apply)
    }

  # google_essential_contacts_contact.essential_contacts["gcp-audit-data@ttecfedgcp.us"] will be created
  + resource "google_essential_contacts_contact" "essential_contacts" {
      + email                               = "gcp-audit-data@ttecfedgcp.us"
      + id                                  = (known after apply)
      + language_tag                        = "en"
      + name                                = (known after apply)
      + notification_category_subscriptions = [
          + "LEGAL",
        ]
      + parent                              = "organizations/554319599275/locations/us-central1/workloads/00-4d615296-8edd-49ae-b364-417"
    }

  # google_essential_contacts_contact.essential_contacts["gcp-billing-admins@ttecfedgcp.us"] will be created
  + resource "google_essential_contacts_contact" "essential_contacts" {
      + email                               = "gcp-billing-admins@ttecfedgcp.us"
      + id                                  = (known after apply)
      + language_tag                        = "en"
      + name                                = (known after apply)
      + notification_category_subscriptions = [
          + "BILLING",
        ]
      + parent                              = "organizations/554319599275/locations/us-central1/workloads/00-4d615296-8edd-49ae-b364-417"
    }

  # google_essential_contacts_contact.essential_contacts["gcp-billing-data@ttecfedgcp.us"] will be created
  + resource "google_essential_contacts_contact" "essential_contacts" {
      + email                               = "gcp-billing-data@ttecfedgcp.us"
      + id                                  = (known after apply)
      + language_tag                        = "en"
      + name                                = (known after apply)
      + notification_category_subscriptions = [
          + "BILLING",
        ]
      + parent                              = "organizations/554319599275/locations/us-central1/workloads/00-4d615296-8edd-49ae-b364-417"
    }

  # google_essential_contacts_contact.essential_contacts["gcp-organization-admins@ttecfedgcp.us"] will be created
  + resource "google_essential_contacts_contact" "essential_contacts" {
      + email                               = "gcp-organization-admins@ttecfedgcp.us"
      + id                                  = (known after apply)
      + language_tag                        = "en"
      + name                                = (known after apply)
      + notification_category_subscriptions = [
          + "LEGAL",
          + "PRODUCT_UPDATES",
          + "SECURITY",
          + "SUSPENSION",
          + "TECHNICAL",
        ]
      + parent                              = "organizations/554319599275/locations/us-central1/workloads/00-4d615296-8edd-49ae-b364-417"
    }

  # google_folder.common will be created
  + resource "google_folder" "common" {
      + create_time     = (known after apply)
      + display_name    = "fldr-common"
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + name            = (known after apply)
      + parent          = "organizations/554319599275/locations/us-central1/workloads/00-4d615296-8edd-49ae-b364-417"
    }

  # google_folder.network will be created
  + resource "google_folder" "network" {
      + create_time     = (known after apply)
      + display_name    = "fldr-network"
      + folder_id       = (known after apply)
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + name            = (known after apply)
      + parent          = "organizations/554319599275/locations/us-central1/workloads/00-4d615296-8edd-49ae-b364-417"
    }

  # google_organization_iam_member.billing_viewer will be created
  + resource "google_organization_iam_member" "billing_viewer" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "group:gcp-billing-data@ttecfedgcp.us"
      + org_id = "554319599275"
      + role   = "roles/billing.viewer"
    }

  # google_organization_iam_member.kms_usage_tracking[0] will be created
  + resource "google_organization_iam_member" "kms_usage_tracking" {
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:service-org-554319599275@gcp-sa-cloudkms.iam.gserviceaccount.com"
      + org_id = "554319599275"
      + role   = "roles/cloudkms.orgServiceAgent"
    }

  # google_project_iam_member.audit_log_bq_data_viewer will be created
  + resource "google_project_iam_member" "audit_log_bq_data_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "group:gcp-audit-data@ttecfedgcp.us"
      + project = (known after apply)
      + role    = "roles/bigquery.dataViewer"
    }

  # google_project_iam_member.audit_log_bq_user will be created
  + resource "google_project_iam_member" "audit_log_bq_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "group:gcp-audit-data@ttecfedgcp.us"
      + project = (known after apply)
      + role    = "roles/bigquery.user"
    }

  # google_project_iam_member.audit_log_logging_viewer will be created
  + resource "google_project_iam_member" "audit_log_logging_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "group:gcp-audit-data@ttecfedgcp.us"
      + project = (known after apply)
      + role    = "roles/logging.viewer"
    }

  # google_project_iam_member.billing_bq_user will be created
  + resource "google_project_iam_member" "billing_bq_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "group:gcp-billing-data@ttecfedgcp.us"
      + project = (known after apply)
      + role    = "roles/bigquery.user"
    }

  # google_project_iam_member.billing_bq_viewer will be created
  + resource "google_project_iam_member" "billing_bq_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "group:gcp-billing-data@ttecfedgcp.us"
      + project = (known after apply)
      + role    = "roles/bigquery.dataViewer"
    }

  # google_project_iam_member.network_sa["roles/compute.instanceAdmin"] will be created
  + resource "google_project_iam_member" "network_sa" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:sa-terraform-net@prj-b-seed-c3fecb-98dd.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/compute.instanceAdmin"
    }

  # google_project_iam_member.network_sa["roles/iam.serviceAccountAdmin"] will be created
  + resource "google_project_iam_member" "network_sa" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:sa-terraform-net@prj-b-seed-c3fecb-98dd.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/iam.serviceAccountAdmin"
    }

  # google_project_iam_member.network_sa["roles/iam.serviceAccountUser"] will be created
  + resource "google_project_iam_member" "network_sa" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:sa-terraform-net@prj-b-seed-c3fecb-98dd.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/iam.serviceAccountUser"
    }

  # google_project_iam_member.network_sa["roles/resourcemanager.projectIamAdmin"] will be created
  + resource "google_project_iam_member" "network_sa" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:sa-terraform-net@prj-b-seed-c3fecb-98dd.iam.gserviceaccount.com"
      + project = (known after apply)
      + role    = "roles/resourcemanager.projectIamAdmin"
    }

  # google_tags_tag_binding.bootstrap_folder will be created
  + resource "google_tags_tag_binding" "bootstrap_folder" {
      + id        = (known after apply)
      + name      = (known after apply)
      + parent    = "//cloudresourcemanager.googleapis.com/folders/636258557355"
      + tag_value = (known after apply)
    }

  # google_tags_tag_binding.common_folder will be created
  + resource "google_tags_tag_binding" "common_folder" {
      + id        = (known after apply)
      + name      = (known after apply)
      + parent    = (known after apply)
      + tag_value = (known after apply)
    }

  # google_tags_tag_binding.network_folder will be created
  + resource "google_tags_tag_binding" "network_folder" {
      + id        = (known after apply)
      + name      = (known after apply)
      + parent    = (known after apply)
      + tag_value = (known after apply)
    }

  # google_tags_tag_key.tag_keys["environment"] will be created
  + resource "google_tags_tag_key" "tag_keys" {
      + create_time     = (known after apply)
      + description     = "Environment identification"
      + id              = (known after apply)
      + name            = (known after apply)
      + namespaced_name = (known after apply)
      + parent          = "organizations/554319599275"
      + short_name      = (known after apply)
      + update_time     = (known after apply)
    }

  # google_tags_tag_value.tag_values["environment_bootstrap"] will be created
  + resource "google_tags_tag_value" "tag_values" {
      + create_time     = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + namespaced_name = (known after apply)
      + parent          = (known after apply)
      + short_name      = "bootstrap"
      + update_time     = (known after apply)
    }

  # google_tags_tag_value.tag_values["environment_development"] will be created
  + resource "google_tags_tag_value" "tag_values" {
      + create_time     = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + namespaced_name = (known after apply)
      + parent          = (known after apply)
      + short_name      = "development"
      + update_time     = (known after apply)
    }

  # google_tags_tag_value.tag_values["environment_nonproduction"] will be created
  + resource "google_tags_tag_value" "tag_values" {
      + create_time     = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + namespaced_name = (known after apply)
      + parent          = (known after apply)
      + short_name      = "nonproduction"
      + update_time     = (known after apply)
    }

  # google_tags_tag_value.tag_values["environment_production"] will be created
  + resource "google_tags_tag_value" "tag_values" {
      + create_time     = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + namespaced_name = (known after apply)
      + parent          = (known after apply)
      + short_name      = "production"
      + update_time     = (known after apply)
    }

  # random_string.suffix will be created
  + resource "random_string" "suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # random_string.tag_key_suffix will be created
  + resource "random_string" "tag_key_suffix" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # time_sleep.wait_logs_export will be created
  + resource "time_sleep" "wait_logs_export" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

  # module.create_kms_organization_service_agent.null_resource.run_command[0] will be created
  + resource "null_resource" "run_command" {
      + id       = (known after apply)
      + triggers = {
          + "arguments"             = "6e5ceddac4c5a054a98a66f79c6b9808"
          + "create_cmd_body"       = "beta services identity create --service cloudkms.googleapis.com --organization 554319599275"
          + "create_cmd_entrypoint" = "gcloud"
          + "gcloud_bin_abs_path"   = "/google-cloud-sdk/bin"
          + "md5"                   = "7f22bf39aaf5ce5980111c3587bef5b5"
          + "org_id"                = "554319599275"
        }
    }

  # module.create_kms_organization_service_agent.null_resource.run_destroy_command[0] will be created
  + resource "null_resource" "run_destroy_command" {
      + id       = (known after apply)
      + triggers = {
          + "destroy_cmd_body"       = "info"
          + "destroy_cmd_entrypoint" = "gcloud"
          + "gcloud_bin_abs_path"    = "/google-cloud-sdk/bin"
          + "org_id"                 = "554319599275"
        }
    }

  # module.domain_restricted_contacts.google_organization_policy.org_policy_list_allow_values[0] will be created
  + resource "google_organization_policy" "org_policy_list_allow_values" {
      + constraint  = "constraints/essentialcontacts.allowedContactDomains"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "554319599275"
      + update_time = (known after apply)
      + version     = (known after apply)

      + list_policy {
          + suggested_value = (known after apply)

          + allow {
              + all    = false
              + values = [
                  + "@ttecdigital.com",
                  + "@ttecfedgcp.us",
                ]
            }
        }
    }

  # module.logs_export.google_project_iam_member.project_sink_member["resource"] will be created
  + resource "google_project_iam_member" "project_sink_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/logging.logWriter"
    }

  # module.logs_export.google_project_iam_member.project_sink_member_billing[0] will be created
  + resource "google_project_iam_member" "project_sink_member_billing" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/logging.logWriter"
    }

  # module.logs_export.google_pubsub_topic_iam_member.pubsub_sink_member["resource"] will be created
  + resource "google_pubsub_topic_iam_member" "pubsub_sink_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/pubsub.publisher"
      + topic   = (known after apply)
    }

  # module.logs_export.google_pubsub_topic_iam_member.pubsub_sink_member_billing[0] will be created
  + resource "google_pubsub_topic_iam_member" "pubsub_sink_member_billing" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/pubsub.publisher"
      + topic   = (known after apply)
    }

  # module.logs_export.google_storage_bucket_iam_member.storage_sink_member["resource"] will be created
  + resource "google_storage_bucket_iam_member" "storage_sink_member" {
      + bucket = (known after apply)
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectCreator"
    }

  # module.logs_export.google_storage_bucket_iam_member.storage_sink_member_billing[0] will be created
  + resource "google_storage_bucket_iam_member" "storage_sink_member_billing" {
      + bucket = (known after apply)
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectCreator"
    }

  # module.logs_export.random_string.suffix will be created
  + resource "random_string" "suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.logs_export.terracurl_request.exclude_external_logs[0] will be created
  + resource "terracurl_request" "exclude_external_logs" {
      + destroy_retry_interval = 10
      + destroy_skip           = true
      + destroy_timeout        = 10
      + headers                = {
          + "Authorization" = (sensitive value)
          + "Content-Type"  = "application/json"
        }
      + id                     = (known after apply)
      + method                 = "PUT"
      + name                   = "exclude_external_logs"
      + request_body           = (known after apply)
      + request_url_string     = (known after apply)
      + response               = (known after apply)
      + response_codes         = [
          + "200",
        ]
      + retry_interval         = 10
      + status_code            = (known after apply)
      + timeout                = 10
      + url                    = (known after apply)
    }

  # module.logs_export.time_sleep.wait_sa_iam_membership will be created
  + resource "time_sleep" "wait_sa_iam_membership" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

  # module.org_domain_restricted_sharing.data.google_organization.orgs["ttecfedgcp.us"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_organization" "orgs" {
      + create_time           = (known after apply)
      + directory_customer_id = (known after apply)
      + domain                = "ttecfedgcp.us"
      + id                    = (known after apply)
      + lifecycle_state       = (known after apply)
      + name                  = (known after apply)
      + org_id                = (known after apply)
    }

  # module.org_vm_external_ip_access.google_organization_policy.org_policy_list_deny_all[0] will be created
  + resource "google_organization_policy" "org_policy_list_deny_all" {
      + constraint  = "constraints/compute.vmExternalIpAccess"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "554319599275"
      + update_time = (known after apply)
      + version     = (known after apply)

      + list_policy {
          + suggested_value = (known after apply)

          + deny {
              + all = true
            }
        }
    }

  # module.organization_policies_type_boolean["compute.disableNestedVirtualization"].google_organization_policy.org_policy_boolean[0] will be created
  + resource "google_organization_policy" "org_policy_boolean" {
      + constraint  = "constraints/compute.disableNestedVirtualization"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "554319599275"
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.organization_policies_type_boolean["compute.disableSerialPortAccess"].google_organization_policy.org_policy_boolean[0] will be created
  + resource "google_organization_policy" "org_policy_boolean" {
      + constraint  = "constraints/compute.disableSerialPortAccess"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "554319599275"
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.organization_policies_type_boolean["compute.disableVpcExternalIpv6"].google_organization_policy.org_policy_boolean[0] will be created
  + resource "google_organization_policy" "org_policy_boolean" {
      + constraint  = "constraints/compute.disableVpcExternalIpv6"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "554319599275"
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.organization_policies_type_boolean["compute.requireOsLogin"].google_organization_policy.org_policy_boolean[0] will be created
  + resource "google_organization_policy" "org_policy_boolean" {
      + constraint  = "constraints/compute.requireOsLogin"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "554319599275"
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.organization_policies_type_boolean["compute.restrictXpnProjectLienRemoval"].google_organization_policy.org_policy_boolean[0] will be created
  + resource "google_organization_policy" "org_policy_boolean" {
      + constraint  = "constraints/compute.restrictXpnProjectLienRemoval"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "554319599275"
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.organization_policies_type_boolean["compute.setNewProjectDefaultToZonalDNSOnly"].google_organization_policy.org_policy_boolean[0] will be created
  + resource "google_organization_policy" "org_policy_boolean" {
      + constraint  = "constraints/compute.setNewProjectDefaultToZonalDNSOnly"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "554319599275"
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.organization_policies_type_boolean["compute.skipDefaultNetworkCreation"].google_organization_policy.org_policy_boolean[0] will be created
  + resource "google_organization_policy" "org_policy_boolean" {
      + constraint  = "constraints/compute.skipDefaultNetworkCreation"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "554319599275"
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.organization_policies_type_boolean["iam.automaticIamGrantsForDefaultServiceAccounts"].google_organization_policy.org_policy_boolean[0] will be created
  + resource "google_organization_policy" "org_policy_boolean" {
      + constraint  = "constraints/iam.automaticIamGrantsForDefaultServiceAccounts"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "554319599275"
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.organization_policies_type_boolean["iam.disableServiceAccountKeyCreation"].google_organization_policy.org_policy_boolean[0] will be created
  + resource "google_organization_policy" "org_policy_boolean" {
      + constraint  = "constraints/iam.disableServiceAccountKeyCreation"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "554319599275"
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.organization_policies_type_boolean["iam.disableServiceAccountKeyUpload"].google_organization_policy.org_policy_boolean[0] will be created
  + resource "google_organization_policy" "org_policy_boolean" {
      + constraint  = "constraints/iam.disableServiceAccountKeyUpload"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "554319599275"
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.organization_policies_type_boolean["sql.restrictAuthorizedNetworks"].google_organization_policy.org_policy_boolean[0] will be created
  + resource "google_organization_policy" "org_policy_boolean" {
      + constraint  = "constraints/sql.restrictAuthorizedNetworks"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "554319599275"
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.organization_policies_type_boolean["sql.restrictPublicIp"].google_organization_policy.org_policy_boolean[0] will be created
  + resource "google_organization_policy" "org_policy_boolean" {
      + constraint  = "constraints/sql.restrictPublicIp"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "554319599275"
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.organization_policies_type_boolean["storage.publicAccessPrevention"].google_organization_policy.org_policy_boolean[0] will be created
  + resource "google_organization_policy" "org_policy_boolean" {
      + constraint  = "constraints/storage.publicAccessPrevention"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "554319599275"
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.organization_policies_type_boolean["storage.uniformBucketLevelAccess"].google_organization_policy.org_policy_boolean[0] will be created
  + resource "google_organization_policy" "org_policy_boolean" {
      + constraint  = "constraints/storage.uniformBucketLevelAccess"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "554319599275"
      + update_time = (known after apply)
      + version     = (known after apply)

      + boolean_policy {
          + enforced = true
        }
    }

  # module.restrict_protocol_fowarding.google_organization_policy.org_policy_list_allow_values[0] will be created
  + resource "google_organization_policy" "org_policy_list_allow_values" {
      + constraint  = "constraints/compute.restrictProtocolForwardingCreationForTypes"
      + etag        = (known after apply)
      + id          = (known after apply)
      + org_id      = "554319599275"
      + update_time = (known after apply)
      + version     = (known after apply)

      + list_policy {
          + suggested_value = (known after apply)

          + allow {
              + all    = false
              + values = [
                  + "INTERNAL",
                ]
            }
        }
    }

  # module.common_kms.module.budget.data.google_project.project[0] will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + deletion_policy     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.common_kms.module.budget.google_billing_budget.budget[0] will be created
  + resource "google_billing_budget" "budget" {
      + billing_account = "01C15F-8E2924-09AF0A"
      + display_name    = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)

      + amount {
          + specified_amount {
              + currency_code = (known after apply)
              + units         = "1000"
            }
        }

      + budget_filter {
          + credit_types           = (known after apply)
          + credit_types_treatment = "INCLUDE_ALL_CREDITS"
          + labels                 = (known after apply)
          + projects               = (known after apply)
          + services               = (known after apply)
          + subaccounts            = (known after apply)
        }

      + threshold_rules {
          + spend_basis       = "FORECASTED_SPEND"
          + threshold_percent = 1.2
        }
    }

  # module.common_kms.module.project-factory.google_project.main will be created
  + resource "google_project" "main" {
      + auto_create_network = false
      + billing_account     = "01C15F-8E2924-09AF0A"
      + deletion_policy     = "PREVENT"
      + effective_labels    = {
          + "application_name"  = "org-kms"
          + "billing_code"      = "1234"
          + "business_code"     = "shared"
          + "env_code"          = "c"
          + "environment"       = "common"
          + "primary_contact"   = "example1"
          + "secondary_contact" = "example2"
          + "vpc"               = "none"
        }
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = {
          + "application_name"  = "org-kms"
          + "billing_code"      = "1234"
          + "business_code"     = "shared"
          + "env_code"          = "c"
          + "environment"       = "common"
          + "primary_contact"   = "example1"
          + "secondary_contact" = "example2"
          + "vpc"               = "none"
        }
      + name                = "prj-c-kms"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
      + terraform_labels    = {
          + "application_name"  = "org-kms"
          + "billing_code"      = "1234"
          + "business_code"     = "shared"
          + "env_code"          = "c"
          + "environment"       = "common"
          + "primary_contact"   = "example1"
          + "secondary_contact" = "example2"
          + "vpc"               = "none"
        }
    }

  # module.common_kms.module.project-factory.google_project_default_service_accounts.default_service_accounts[0] will be created
  + resource "google_project_default_service_accounts" "default_service_accounts" {
      + action           = "DEPRIVILEGE"
      + id               = (known after apply)
      + project          = (known after apply)
      + restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      + service_accounts = (known after apply)
    }

  # module.common_kms.module.project-factory.google_service_account.default_service_account[0] will be created
  + resource "google_service_account" "default_service_account" {
      + account_id                   = "project-service-account"
      + create_ignore_already_exists = true
      + disabled                     = false
      + display_name                 = "prj-c-kms Project Service Account"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = (known after apply)
      + unique_id                    = (known after apply)
    }

  # module.common_kms.module.project-factory.random_id.random_project_id_suffix will be created
  + resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.common_kms.module.project-factory.random_string.random_project_id_suffix[0] will be created
  + resource "random_string" "random_project_id_suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.interconnect.module.budget.data.google_project.project[0] will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + deletion_policy     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.interconnect.module.budget.google_billing_budget.budget[0] will be created
  + resource "google_billing_budget" "budget" {
      + billing_account = "01C15F-8E2924-09AF0A"
      + display_name    = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)

      + amount {
          + specified_amount {
              + currency_code = (known after apply)
              + units         = "1000"
            }
        }

      + budget_filter {
          + credit_types           = (known after apply)
          + credit_types_treatment = "INCLUDE_ALL_CREDITS"
          + labels                 = (known after apply)
          + projects               = (known after apply)
          + services               = (known after apply)
          + subaccounts            = (known after apply)
        }

      + threshold_rules {
          + spend_basis       = "FORECASTED_SPEND"
          + threshold_percent = 1.2
        }
    }

  # module.interconnect.module.project-factory.google_project.main will be created
  + resource "google_project" "main" {
      + auto_create_network = false
      + billing_account     = "01C15F-8E2924-09AF0A"
      + deletion_policy     = "PREVENT"
      + effective_labels    = {
          + "application_name"  = "org-interconnect"
          + "billing_code"      = "1234"
          + "business_code"     = "shared"
          + "env_code"          = "net"
          + "environment"       = "network"
          + "primary_contact"   = "example1"
          + "secondary_contact" = "example2"
          + "vpc"               = "none"
        }
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = {
          + "application_name"  = "org-interconnect"
          + "billing_code"      = "1234"
          + "business_code"     = "shared"
          + "env_code"          = "net"
          + "environment"       = "network"
          + "primary_contact"   = "example1"
          + "secondary_contact" = "example2"
          + "vpc"               = "none"
        }
      + name                = "prj-net-interconnect"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
      + terraform_labels    = {
          + "application_name"  = "org-interconnect"
          + "billing_code"      = "1234"
          + "business_code"     = "shared"
          + "env_code"          = "net"
          + "environment"       = "network"
          + "primary_contact"   = "example1"
          + "secondary_contact" = "example2"
          + "vpc"               = "none"
        }
    }

  # module.interconnect.module.project-factory.google_project_default_service_accounts.default_service_accounts[0] will be created
  + resource "google_project_default_service_accounts" "default_service_accounts" {
      + action           = "DEPRIVILEGE"
      + id               = (known after apply)
      + project          = (known after apply)
      + restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      + service_accounts = (known after apply)
    }

  # module.interconnect.module.project-factory.google_service_account.default_service_account[0] will be created
  + resource "google_service_account" "default_service_account" {
      + account_id                   = "project-service-account"
      + create_ignore_already_exists = true
      + disabled                     = false
      + display_name                 = "prj-net-interconnect Project Service Account"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = (known after apply)
      + unique_id                    = (known after apply)
    }

  # module.interconnect.module.project-factory.random_id.random_project_id_suffix will be created
  + resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.interconnect.module.project-factory.random_string.random_project_id_suffix[0] will be created
  + resource "random_string" "random_project_id_suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.logs_export.module.destination_aggregated_logs[0].google_logging_linked_dataset.linked_dataset[0] will be created
  + resource "google_logging_linked_dataset" "linked_dataset" {
      + bucket          = (known after apply)
      + create_time     = (known after apply)
      + description     = "Project destination BigQuery Dataset for Logbucket analytics"
      + id              = (known after apply)
      + lifecycle_state = (known after apply)
      + link_id         = "ds_c_prj_aggregated_logs_analytics"
      + location        = "us-central1"
      + name            = (known after apply)
      + parent          = (known after apply)
    }

  # module.logs_export.module.destination_aggregated_logs[0].google_logging_project_bucket_config.bucket will be created
  + resource "google_logging_project_bucket_config" "bucket" {
      + bucket_id        = "AggregatedLogs"
      + description      = (known after apply)
      + enable_analytics = true
      + id               = (known after apply)
      + lifecycle_state  = (known after apply)
      + location         = "us-central1"
      + name             = (known after apply)
      + project          = (known after apply)
      + retention_days   = 30
    }

  # module.logs_export.module.destination_aggregated_logs[0].google_project_service.enable_destination_api will be created
  + resource "google_project_service" "enable_destination_api" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "logging.googleapis.com"
    }

  # module.logs_export.module.destination_project[0].google_project_iam_member.log_sink_member will be created
  + resource "google_project_iam_member" "log_sink_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/logging.logWriter"
    }

  # module.logs_export.module.destination_pubsub[0].google_project_service.enable_destination_api will be created
  + resource "google_project_service" "enable_destination_api" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "pubsub.googleapis.com"
    }

  # module.logs_export.module.destination_pubsub[0].google_pubsub_subscription.pubsub_subscription[0] will be created
  + resource "google_pubsub_subscription" "pubsub_subscription" {
      + ack_deadline_seconds       = (known after apply)
      + effective_labels           = (known after apply)
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = (known after apply)
      + project                    = (known after apply)
      + terraform_labels           = (known after apply)
      + topic                      = (known after apply)
    }

  # module.logs_export.module.destination_pubsub[0].google_pubsub_subscription_iam_member.pubsub_subscriber_role[0] will be created
  + resource "google_pubsub_subscription_iam_member" "pubsub_subscriber_role" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + project      = (known after apply)
      + role         = "roles/pubsub.subscriber"
      + subscription = (known after apply)
    }

  # module.logs_export.module.destination_pubsub[0].google_pubsub_topic.topic will be created
  + resource "google_pubsub_topic" "topic" {
      + effective_labels = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + project          = (known after apply)
      + terraform_labels = (known after apply)
    }

  # module.logs_export.module.destination_pubsub[0].google_pubsub_topic_iam_member.pubsub_sink_member will be created
  + resource "google_pubsub_topic_iam_member" "pubsub_sink_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/pubsub.publisher"
      + topic   = (known after apply)
    }

  # module.logs_export.module.destination_pubsub[0].google_pubsub_topic_iam_member.pubsub_viewer_role[0] will be created
  + resource "google_pubsub_topic_iam_member" "pubsub_viewer_role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/pubsub.viewer"
      + topic   = (known after apply)
    }

  # module.logs_export.module.destination_pubsub[0].google_service_account.pubsub_subscriber[0] will be created
  + resource "google_service_account" "pubsub_subscriber" {
      + account_id   = (known after apply)
      + disabled     = false
      + display_name = (known after apply)
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.logs_export.module.destination_storage[0].google_project_service.enable_destination_api will be created
  + resource "google_project_service" "enable_destination_api" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "storage-component.googleapis.com"
    }

  # module.logs_export.module.destination_storage[0].google_storage_bucket.bucket will be created
  + resource "google_storage_bucket" "bucket" {
      + effective_labels            = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "US"
      + name                        = (known after apply)
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "inherited"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = false
        }
    }

  # module.logs_export.module.destination_storage[0].google_storage_bucket_iam_member.storage_sink_member will be created
  + resource "google_storage_bucket_iam_member" "storage_sink_member" {
      + bucket = (known after apply)
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectCreator"
    }

  # module.logs_export.module.internal_project_log_export[0].google_logging_project_sink.sink[0] will be created
  + resource "google_logging_project_sink" "sink" {
      + destination            = (known after apply)
      + disabled               = false
      + filter                 = <<-EOT
            logName: /logs/cloudaudit.googleapis.com%2Factivity OR
                logName: /logs/cloudaudit.googleapis.com%2Fsystem_event OR
                logName: /logs/cloudaudit.googleapis.com%2Fdata_access OR
                logName: /logs/cloudaudit.googleapis.com%2Faccess_transparency OR
                logName: /logs/cloudaudit.googleapis.com%2Fpolicy OR
                logName: /logs/compute.googleapis.com%2Fvpc_flows OR
                logName: /logs/compute.googleapis.com%2Ffirewall OR
                logName: /logs/dns.googleapis.com%2Fdns_queries
        EOT
      + id                     = (known after apply)
      + name                   = "sk-c-logging-prj-la"
      + project                = (known after apply)
      + unique_writer_identity = true
      + writer_identity        = (known after apply)
    }

  # module.logs_export.module.log_export["554319599275_prj"].google_logging_organization_sink.sink[0] will be created
  + resource "google_logging_organization_sink" "sink" {
      + destination        = (known after apply)
      + disabled           = false
      + filter             = <<-EOT
            logName: /logs/cloudaudit.googleapis.com%2Factivity OR
                logName: /logs/cloudaudit.googleapis.com%2Fsystem_event OR
                logName: /logs/cloudaudit.googleapis.com%2Fdata_access OR
                logName: /logs/cloudaudit.googleapis.com%2Faccess_transparency OR
                logName: /logs/cloudaudit.googleapis.com%2Fpolicy OR
                logName: /logs/compute.googleapis.com%2Fvpc_flows OR
                logName: /logs/compute.googleapis.com%2Ffirewall OR
                logName: /logs/dns.googleapis.com%2Fdns_queries
        EOT
      + id                 = (known after apply)
      + include_children   = true
      + intercept_children = false
      + name               = "sk-c-logging-prj"
      + org_id             = "554319599275"
      + writer_identity    = (known after apply)
    }

  # module.logs_export.module.log_export["554319599275_pub"].google_logging_organization_sink.sink[0] will be created
  + resource "google_logging_organization_sink" "sink" {
      + destination        = (known after apply)
      + disabled           = false
      + filter             = <<-EOT
            logName: /logs/cloudaudit.googleapis.com%2Factivity OR
                logName: /logs/cloudaudit.googleapis.com%2Fsystem_event OR
                logName: /logs/cloudaudit.googleapis.com%2Fdata_access OR
                logName: /logs/cloudaudit.googleapis.com%2Faccess_transparency OR
                logName: /logs/cloudaudit.googleapis.com%2Fpolicy OR
                logName: /logs/compute.googleapis.com%2Fvpc_flows OR
                logName: /logs/compute.googleapis.com%2Ffirewall OR
                logName: /logs/dns.googleapis.com%2Fdns_queries
        EOT
      + id                 = (known after apply)
      + include_children   = true
      + intercept_children = false
      + name               = "sk-c-logging-pub"
      + org_id             = "554319599275"
      + writer_identity    = (known after apply)
    }

  # module.logs_export.module.log_export["554319599275_sto"].google_logging_organization_sink.sink[0] will be created
  + resource "google_logging_organization_sink" "sink" {
      + destination        = (known after apply)
      + disabled           = false
      + filter             = <<-EOT
            logName: /logs/cloudaudit.googleapis.com%2Factivity OR
                logName: /logs/cloudaudit.googleapis.com%2Fsystem_event OR
                logName: /logs/cloudaudit.googleapis.com%2Fdata_access OR
                logName: /logs/cloudaudit.googleapis.com%2Faccess_transparency OR
                logName: /logs/cloudaudit.googleapis.com%2Fpolicy OR
                logName: /logs/compute.googleapis.com%2Fvpc_flows OR
                logName: /logs/compute.googleapis.com%2Ffirewall OR
                logName: /logs/dns.googleapis.com%2Fdns_queries
        EOT
      + id                 = (known after apply)
      + include_children   = true
      + intercept_children = false
      + name               = "sk-c-logging-bkt"
      + org_id             = "554319599275"
      + writer_identity    = (known after apply)
    }

  # module.logs_export.module.log_export_billing["prj"].google_logging_billing_account_sink.sink[0] will be created
  + resource "google_logging_billing_account_sink" "sink" {
      + billing_account = "01C15F-8E2924-09AF0A"
      + destination     = (known after apply)
      + disabled        = false
      + id              = (known after apply)
      + name            = (known after apply)
      + writer_identity = (known after apply)
    }

  # module.logs_export.module.log_export_billing["pub"].google_logging_billing_account_sink.sink[0] will be created
  + resource "google_logging_billing_account_sink" "sink" {
      + billing_account = "01C15F-8E2924-09AF0A"
      + destination     = (known after apply)
      + disabled        = false
      + id              = (known after apply)
      + name            = (known after apply)
      + writer_identity = (known after apply)
    }

  # module.logs_export.module.log_export_billing["sto"].google_logging_billing_account_sink.sink[0] will be created
  + resource "google_logging_billing_account_sink" "sink" {
      + billing_account = "01C15F-8E2924-09AF0A"
      + destination     = (known after apply)
      + disabled        = false
      + id              = (known after apply)
      + name            = (known after apply)
      + writer_identity = (known after apply)
    }

  # module.network_hub[0].module.budget.data.google_project.project[0] will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + deletion_policy     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.network_hub[0].module.budget.google_billing_budget.budget[0] will be created
  + resource "google_billing_budget" "budget" {
      + billing_account = "01C15F-8E2924-09AF0A"
      + display_name    = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)

      + amount {
          + specified_amount {
              + currency_code = (known after apply)
              + units         = "1000"
            }
        }

      + budget_filter {
          + credit_types           = (known after apply)
          + credit_types_treatment = "INCLUDE_ALL_CREDITS"
          + labels                 = (known after apply)
          + projects               = (known after apply)
          + services               = (known after apply)
          + subaccounts            = (known after apply)
        }

      + threshold_rules {
          + spend_basis       = "FORECASTED_SPEND"
          + threshold_percent = 1.2
        }
    }

  # module.network_hub[0].module.project-factory.google_project.main will be created
  + resource "google_project" "main" {
      + auto_create_network = false
      + billing_account     = "01C15F-8E2924-09AF0A"
      + deletion_policy     = "PREVENT"
      + effective_labels    = {
          + "application_name"  = "org-net-hub"
          + "billing_code"      = "1234"
          + "business_code"     = "shared"
          + "env_code"          = "net"
          + "environment"       = "network"
          + "primary_contact"   = "example1"
          + "secondary_contact" = "example2"
          + "vpc"               = "svpc"
        }
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = {
          + "application_name"  = "org-net-hub"
          + "billing_code"      = "1234"
          + "business_code"     = "shared"
          + "env_code"          = "net"
          + "environment"       = "network"
          + "primary_contact"   = "example1"
          + "secondary_contact" = "example2"
          + "vpc"               = "svpc"
        }
      + name                = "prj-net-hub"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
      + terraform_labels    = {
          + "application_name"  = "org-net-hub"
          + "billing_code"      = "1234"
          + "business_code"     = "shared"
          + "env_code"          = "net"
          + "environment"       = "network"
          + "primary_contact"   = "example1"
          + "secondary_contact" = "example2"
          + "vpc"               = "svpc"
        }
    }

  # module.network_hub[0].module.project-factory.google_project_default_service_accounts.default_service_accounts[0] will be created
  + resource "google_project_default_service_accounts" "default_service_accounts" {
      + action           = "DEPRIVILEGE"
      + id               = (known after apply)
      + project          = (known after apply)
      + restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      + service_accounts = (known after apply)
    }

  # module.network_hub[0].module.project-factory.google_service_account.default_service_account[0] will be created
  + resource "google_service_account" "default_service_account" {
      + account_id                   = "project-service-account"
      + create_ignore_already_exists = true
      + disabled                     = false
      + display_name                 = "prj-net-hub Project Service Account"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = (known after apply)
      + unique_id                    = (known after apply)
    }

  # module.network_hub[0].module.project-factory.random_id.random_project_id_suffix will be created
  + resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.network_hub[0].module.project-factory.random_string.random_project_id_suffix[0] will be created
  + resource "random_string" "random_project_id_suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.org_audit_logs.module.budget.data.google_project.project[0] will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + deletion_policy     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.org_audit_logs.module.budget.google_billing_budget.budget[0] will be created
  + resource "google_billing_budget" "budget" {
      + billing_account = "01C15F-8E2924-09AF0A"
      + display_name    = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)

      + amount {
          + specified_amount {
              + currency_code = (known after apply)
              + units         = "1000"
            }
        }

      + budget_filter {
          + credit_types           = (known after apply)
          + credit_types_treatment = "INCLUDE_ALL_CREDITS"
          + labels                 = (known after apply)
          + projects               = (known after apply)
          + services               = (known after apply)
          + subaccounts            = (known after apply)
        }

      + threshold_rules {
          + spend_basis       = "FORECASTED_SPEND"
          + threshold_percent = 1.2
        }
    }

  # module.org_audit_logs.module.project-factory.google_project.main will be created
  + resource "google_project" "main" {
      + auto_create_network = false
      + billing_account     = "01C15F-8E2924-09AF0A"
      + deletion_policy     = "PREVENT"
      + effective_labels    = {
          + "application_name"  = "org-logging"
          + "billing_code"      = "1234"
          + "business_code"     = "shared"
          + "env_code"          = "c"
          + "environment"       = "common"
          + "primary_contact"   = "example1"
          + "secondary_contact" = "example2"
          + "vpc"               = "none"
        }
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = {
          + "application_name"  = "org-logging"
          + "billing_code"      = "1234"
          + "business_code"     = "shared"
          + "env_code"          = "c"
          + "environment"       = "common"
          + "primary_contact"   = "example1"
          + "secondary_contact" = "example2"
          + "vpc"               = "none"
        }
      + name                = "prj-c-logging"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + skip_delete         = (known after apply)
      + terraform_labels    = {
          + "application_name"  = "org-logging"
          + "billing_code"      = "1234"
          + "business_code"     = "shared"
          + "env_code"          = "c"
          + "environment"       = "common"
          + "primary_contact"   = "example1"
          + "secondary_contact" = "example2"
          + "vpc"               = "none"
        }
    }

  # module.org_audit_logs.module.project-factory.google_project_default_service_accounts.default_service_accounts[0] will be created
  + resource "google_project_default_service_accounts" "default_service_accounts" {
      + action           = "DEPRIVILEGE"
      + id               = (known after apply)
      + project          = (known after apply)
      + restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      + service_accounts = (known after apply)
    }

  # module.org_audit_logs.module.project-factory.google_service_account.default_service_account[0] will be created
  + resource "google_service_account" "default_service_account" {
      + account_id                   = "project-service-account"
      + create_ignore_already_exists = true
      + disabled                     = false
      + display_name                 = "prj-c-logging Project Service Account"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = (known after apply)
      + unique_id                    = (known after apply)
    }

  # module.org_audit_logs.module.project-factory.random_id.random_project_id_suffix will be created
  + resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.org_audit_logs.module.project-factory.random_string.random_project_id_suffix[0] will be created
  + resource "random_string" "random_project_id_suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    } ...
  ```

  </details>
  Output is too long and was truncated. You can read full Plan in <a href="https://github.com/rangutie/gcp-1-organization/actions/runs/17467521703">Actions</a>.<br /><br />
  